#+title: Notes

* geosite
#+begin_src sh :dir "/sudo::" :var file="/usr/local/share/xray/geosite.dat"
  sudo wget https://github.com/v2fly/domain-list-community/releases/latest/download/dlc.dat -O $file
  ls -lh $file
#+end_src

#+RESULTS:
: -rw-r--r--  1 misaka  admin   1.0M Dec  9 18:09 /usr/local/share/xray/geosite.dat
* geoip
#+begin_src sh :dir "/sudo::" :var file="/usr/local/share/xray/geoip.dat"
  sudo wget https://raw.githubusercontent.com/Loyalsoldier/geoip/release/geoip.dat -O $file
  ls -lh $file
#+end_src

#+RESULTS:
: -rw-r--r--  1 misaka  admin    11M Dec 13 08:14 /usr/local/share/xray/geoip.dat
* mmdb
#+begin_src sh :dir "/sudo::" :var file="/usr/local/bin/geo.mmdb"
  sudo wget https://github.com/Loyalsoldier/geoip/releases/latest/download/Country.mmdb -O $file
  ls -lh $file
#+end_src

#+RESULTS:
: -rw-r--r--  1 root  admin   5.4M Nov 11 08:49 /usr/local/bin/geo.mmdb
